```yaml
title: SSH Brute Force Success
id: a1b2c3d4-e5f6-7890-abcd-ef1234567890
status: experimental
description: >
 detects ssh brute froce success. multiple failure followed by success casue a high severity risk.acttal logic is handeled by rule_007.py
author: Yuvraj Pandey
date: 2026/06/04
tags:
    - attack.initial_access
    - attack.t1110.001
logsource:
    product: linux
    service: auth
detection:
    selection:
        message|contains:
            - 'Accepted password'
    condition: selection
falsepositives:
    - Legitimate users mistyping passwords
references:
    - https://attack.mitre.org/techniques/T1110/001/
level: critical

```